taylortrimble/pic18usb/USBFramework.c
                        case USB_ENDPOINT_REQUEST:
                            if (_USBDeviceState == USBDeviceStateAddressed) {
                                _USBResetEP0InBuffer();
                            } else if (_USBDeviceState == USBDeviceStateConfigured) {
                                if (*(&UEP0+(wIndex&0x000F)) & (wIndex&0x80?EPINEN:EPOUTEN)) {  // If endpoint is enabled in specified directiong
                                    *(unsigned char *)(0x200+((wIndex&0x000F)*0x08)+((wIndex&0x0080)*0x04)) = 0x00; // Clear endpoint descriptor
                                } else {
                                    _USBResetEP0InBuffer();
                                }
                            } else {
                                _USBHandleControlError();
                            }
                            break;

                        case USB_INTERFACE_REQUEST: // Should never happen
                        default:
                            _USBHandleControlError();
                            break;
                    }
                    break;
                    
                case SET_FEATURE:
                    switch (bmRequestType) {
                        case USB_DEVICE_REQUEST:
                            switch (wValue) {
                                case DEVICE_REMOTE_WAKEUP:
                                    _USBDeviceStatus |= USBDeviceStatusDeviceRemoteWakeup;
                                    _USBResetEP0InBuffer();
                                    break;

                                case TEST_MODE:
                                    _USBDeviceStatus |= USBDeviceStatusTestMode;
                                    _USBResetEP0InBuffer();
                                    break;

                                default:
                                    _USBHandleControlError();
                                    break;
                            }
                            break;

                        case USB_ENDPOINT_REQUEST:
                            if (_USBDeviceState == USBDeviceStateAddressed) {
                                _USBResetEP0InBuffer();
                            } else if (_USBDeviceState == USBDeviceStateConfigured) {
                                if (*(&UEP0+(wIndex&0x000F)) & (wIndex&0x80?EPINEN:EPOUTEN)) {  // If endpoint is enabled in specified directiong
                                    *(unsigned char *)(0x200+((wIndex&0x000F)*0x08)+((wIndex&0x0080)*0x04)) = (UOWN|BSTALL);    // Stall endpoint
                                } else {
                                    _USBResetEP0InBuffer();
                                }
                            } else {
                                _USBHandleControlError();
                            }
                            break;

                        case USB_INTERFACE_REQUEST: // Should never happen
                        default:
                            _USBHandleControlError();
                            break;
                    }
                    break;
                case SET_ADDRESS:
                    // Device only
                    if (wValue <= 127) {
                        _USBEngineStatus |= USBEngineStatusAddressing;
                        _USBPendingDeviceAddress = wValue;
                        _USBResetEP0InBuffer();
                    } else {
                        _USBHandleControlError();
                    }
                    break;
                case GET_DESCRIPTOR:
                    _USBEngineStatus |= USBEngineStatusSendingDescriptor;   // readying a GET_DESCRIPTOR request
                    switch ((wValue>>8)&0x00FF) {       // High byte indicates which type of descriptor to return
                        case DEVICE:
                            _USBWriteSingleDescriptor(_USBDeviceDescriptor);
                            break;
                        case CONFIGURATION:
                            switch (wValue & 0x00FF) {
                                case 0:
                                    _USBWriteDescriptor(_USBConfigurationDescriptors[0], (_USBConfigurationDescriptors[0])[2]+0x100*(_USBConfigurationDescriptors[0])[3]);
                                    break;
                                default:
                                    _USBHandleControlError();    // set Request Error Flag
                            }
                            break;
                        case STRING:
                            _USBWriteSingleDescriptor(_USBStringDescriptors[wValue]);
                            break;
                        default:
                            _USBHandleControlError();    // set Request Error Flag
                    }
                    break;
                case GET_CONFIGURATION:
                    // Device only
                    _USBWriteValue(_USBCurrentConfiguration, 1);
                    break;
                case SET_CONFIGURATION:
                    if ((wValue&0x00FF)<=NUM_CONFIGURATIONS) {
                        UEP1 = 0x00;    // clear all EP control registers except for EP0 to disable EP1-EP15 prior to setting configuration
                        UEP2 = 0x00;
                        UEP3 = 0x00;
                        UEP4 = 0x00;
                        UEP5 = 0x00;
                        UEP6 = 0x00;
                        UEP7 = 0x00;
                        switch (_USBCurrentConfiguration = (wValue&0x00FF)) {
                            case 0:
                                _USBDeviceState = USBDeviceStateAddressed;
#ifdef SHOW_ENUM_STATUS
                                LATC &= 0xE0;
                                LATCbits.LATC2 = 1;
#endif
                                break;
                            default:
                                _USBDeviceState = USBDeviceStateConfigured;
#ifdef SHOW_ENUM_STATUS
                                LATC &= 0xE0;
                                LATCbits.LATC3 = 1;
#endif
                        }
                        _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
                        _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                    } else {
                        _USBHandleControlError();    // set Request Error Flag
                    }
                    break;
                case GET_INTERFACE:
                    switch (_USBDeviceState) {
                        case USBDeviceStateConfigured:
                            if ((wIndex&0x00FF)<NUM_INTERFACES) {
                                _USBBD0I.address[0] = 0x00; // always send back 0 for bAlternateSetting
                                _USBBD0I.count = 0x01;
                                _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                            } else {
                                _USBHandleControlError();    // set Request Error Flag
                            }
                            break;
                        default:
                            _USBHandleControlError();    // set Request Error Flag
                    }
                    break;
                case SET_INTERFACE:
                    switch (_USBDeviceState) {
                        case USBDeviceStateConfigured:
                            if ((wIndex&0x00FF)<NUM_INTERFACES) {
                                switch ((wValue&0x00FF)) {
                                    case 0:     // currently support only bAlternateSetting of 0
                                        _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
                                        _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                                        break;
                                    default:
                                        _USBHandleControlError();    // set Request Error Flag
                                }
                            } else {
                                _USBHandleControlError();    // set Request Error Flag
                            }
                            break;
                        default:
                            _USBHandleControlError();    // set Request Error Flag
                    }
                    break;
                case SET_DESCRIPTOR:
                case SYNCH_FRAME:
                default:
                    _USBHandleControlError();    // set Request Error Flag
            }
            break;
        case USBTokenIN:
            // A pending USB address is committed on an IN token
            if (_USBEngineStatus & USBEngineStatusAddressing) {
                UADDR = _USBPendingDeviceAddress;
                switch (UADDR) {
                    case 0:
                        _USBDeviceState |= USBDeviceStateInitialized;
                        UPDATE_ENUM_STATUS(_USBDeviceState);
                        break;
                        
                    default:
                        _USBDeviceState = USBDeviceStateAddressed;
                        UPDATE_ENUM_STATUS(_USBDeviceState);
                        break;
                }
                _USBEngineStatus &= ~USBEngineStatusAddressing;
            }
            
            // Continue sending any unfinished descriptor transmission
            else if (_USBEngineStatus & USBEngineStatusSendingDescriptor) {
                _USBSendDescriptor();
            }
            break;
        case USBTokenOUT:
            // Any OUT token means no more IN tokens are necessary
            _USBResetEP0InBuffer();
            
